portalnota10github/app/controllers/assinar_controller.rb

SELECT * FROM `planos` ORDER BY ordem
---
  def index
    @planos = Plano.find :all, :order => 'ordem'

SELECT * FROM `planos` WHERE (`planos`.`id` IS NULL) LIMIT 1
INSERT INTO `users` (`name`, `salt`, `telefone_residencial`, `updated_at`, `crypted_password`, `plano_id`, `nome`, `cpf`, `remember_token_expires_at`, `type`, `data_nascimento`, `ativo_ate`, `remember_token`, `reset_code`, `telefone_celular`, `apelido`, `login`, `sexo`, `email`, `created_at`) VALUES('', 'cb9f375ef874cef652d69602e7a0dd68ea3331c6', '12345', '2010-04-30 19:23:43', 'fa4a6c0a320bb0c4e5e79f74596aaad1968e3b06', NULL, 'fernando pace', '0,0000000000', NULL, NULL, '1985-11-10', NULL, NULL, NULL, '123124', 'fernandao', NULL, 'M', 'fernandaopace@gmail.com', '2010-04-30 19:23:43')
SELECT * FROM `planos` ORDER BY ordem
---
  def cadastro
    logout_keeping_session!

    @user = User.new(params[:user])
    @user.plano = Plano.find_by_id params[:plano]

    success = @user && @user.save

    if success && @user.errors.empty?