portalnota10github/app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `type`, `remember_token`, `reset_code`, `login`, `email`, `created_at`) VALUES('', 'a1b924e6faac4696e6baf5b3811cfadf4b133afa', '2010-04-29 00:47:10', '2a865f2284d25624a0d122d1039c981400c8e503', NULL, NULL, NULL, NULL, 'henrymax', 'henrymax@gmail.com', '2010-04-29 00:47:10')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])

    success = @user && @user.save