app/controllers/aulas_controller.rb

  def index
    @aulas = Aula.paginate :per_page => 12, :page => params[:page], :order => 'created_at desc'

    @classificacao = Classificacao.find :all, :order => 'ordem, nome'
    @series = Serie.find :all, :joins => [:classificacao], :order => 'classificacoes.ordem, series.ordem'
    @materias = Materia.find :all, :order => 'nome'
---
SELECT * FROM `aulas` ORDER BY created_at desc LIMIT 0, 12
SELECT * FROM `classificacoes` ORDER BY ordem, nome
SELECT `series`.* FROM `series` INNER JOIN `classificacoes` ON `classificacoes`.id = `series`.classificacao_id ORDER BY classificacoes.ordem, series.ordem
SELECT * FROM `materias` ORDER BY nome

  def show
    id = params[:id]
    @aula = Aula.find id
    @video = @aula.videos.first
---
SELECT * FROM `aulas` WHERE (`aulas`.`id` = 2)
SELECT * FROM `videos` INNER JOIN `aulas_videos` ON `videos`.id = `aulas_videos`.video_id WHERE (`aulas_videos`.aula_id = 2 ) LIMIT 1