app/controllers/home_controller.rb

SELECT * FROM `noticias` ORDER BY created_at desc LIMIT 3
---
  def index
    @noticias = Noticia.find :all, :limit => 3, :order => "created_at desc"