app/controllers/noticias_controller.rb

  def index
    @noticias = Noticia.paginate :per_page => 12, :page => params[:page], :order => 'created_at desc'
---
SELECT * FROM `noticias` ORDER BY created_at desc LIMIT 0, 12

  def show
    id = params[:id]
    @noticia = Noticia.find id
---
SELECT * FROM `noticias` WHERE (`noticias`.`id` = 4)